run/laserMixedWeld/0/alpha.steel.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.steel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    zmax
    {
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0;
    }

    "(zmin|xmin|xmax|ymin|ymax)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
