run/laserMixedWeld/constant/physicalProperties.argon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

nu              1.45e-05;
rho             1.225;

Cp              1005;
kappa           0.0257;
beta            3.43e-3;

L               0;
alphaSolid
{
    type        constant;
    value       0;
}

// ************************************************************************* //
