run/laserMixedWeld/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ymax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       753600;
    }
    xmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6400;
        startFace       755200;
    }
    xmax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6400;
        startFace       761600;
    }
    ymin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       768000;
    }
    zmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6400;
        startFace       769600;
    }
    zmax
    {
        type            patch;
        nFaces          6400;
        startFace       776000;
    }
)

// ************************************************************************* //
